'''
给定一个包含非负整数的 m x n 网格 grid ，请找出一条从左上角到右下角的路径，使得路径上的数字总和为最小。
说明：每次只能向下或者向右移动一步。
输入：grid = [[1,3,1],[1,5,1],[4,2,1]]
输出：7
解释：因为路径 1→3→1→1→1 的总和最小。
示例 2：

输入：grid = [[1,2,3],[4,5,6]]
输出：12

    1 3 1  1 4 5
    1 5 1  2 7 6
    4 2 1  6 8 7

从左到右，从上到下进行遍历，每次选择来自上方和左边的最小值
  1 2 3  1 3 6
  4 5 6  5 8 12

[0, 2, 2, 6, 4, 1, 6, 2, 9, 9, 5, 8, 4, 4,                0  2  4  10  14  15  21 23 32 41 46 54 58 62
[0, 3, 6, 4, 5, 5, 9, 7, 8, 3, 9, 9, 5, 4],               0  5
[6, 9, 0, 7, 2, 2, 5, 6, 3, 1, 0, 4, 2, 5],               6
[3, 8, 2, 3, 2, 8, 8, 7, 5, 9, 6, 3, 4, 5],               9
[4, 0, 1, 3, 9, 2, 0, 1, 6, 7, 9, 2, 8, 9],               13
[6, 2, 7, 9, 0, 9, 5, 2, 7, 5, 1, 4, 4, 7],               19
[9, 8, 3, 3, 0, 6, 8, 0, 8, 8, 3, 5, 7, 3],               28
[7, 7, 4, 5, 9, 1, 5, 0, 2, 2, 2, 1, 7, 4],               35
[5, 1, 3, 4, 1, 6, 0, 4, 3, 8, 4, 3, 9, 9],               40
[0, 6, 4, 9, 4, 1, 5, 5, 4, 2, 5, 7, 4, 0],               40
[0, 1, 6, 6, 4, 9, 2, 7, 8, 2, 1, 3, 3, 7],               40
[8, 4, 9, 9, 2, 3, 8, 6, 6, 5, 4, 1, 7, 9]]               48


[[0, 2, 4, 10, 14, 15, 21, 23, 32, 41, 46, 54, 58, 62],
[0, 5, 10, 14, 19, 20, 29, 30, 38, 41, 50, 59, 63, 66],
[6, 14, 10, 17, 19, 21, 26, 32, 35, 36, 36, 40, 42, 47],
[9, 17, 12, 15, 17, 25, 33, 39, 40, 45, 42, 43, 46, 51],
[13, 13, 13, 16, 25, 27, 27, 28, 34, 41, 50, 45, 53, 60], [19, 15, 20, 25, 25, 34, 32, 30, 37, 42, 43, 47, 51, 58],
 [28, 23, 23, 26, 25, 31, 39, 30, 38, 46, 46, 51, 58, 61], [35, 30, 27, 31, 34, 32, 37, 30, 32, 34, 36, 37, 44, 48],
 [40, 31, 30, 34, 35, 38, 37, 34, 35, 42, 40, 40, 49, 57], [40, 37, 34, 43, 39, 39, 42, 39, 39, 41, 45, 47, 51, 51],
 [40, 38, 40, 46, 43, 48, 44, 46, 47, 43, 44, 47, 50, 57], [48, 42, 49, 55, 45, 48, 52, 52, 53, 48, 48, 48, 55, 64]]

[[0, 2, 4, 10, 14, 15, 21, 23, 32, 41, 46, 54, 58, 62],
 [0, 3, 9, 13, 18, 20, 29, 30, 38, 41, 50, 59, 63, 66], [6, 12, 9, 16, 18, 20, 25, 31, 34, 35, 35, 39, 41, 46], [9, 17, 11, 14, 16, 24, 32, 38, 39, 44, 41, 42, 45, 50], [13, 13, 12, 15, 24, 26, 26, 27, 33, 40, 49, 44, 52, 59], [19, 15, 19, 24, 24, 33, 31, 29, 36, 41, 42, 46, 50, 57], [28, 23, 22, 25, 24, 30, 38, 29, 37, 45, 45, 50, 57, 60], [35, 30, 26, 30, 33, 31, 36, 29, 31, 33, 35, 36, 43, 47], [40, 31, 29, 33, 34, 37, 36, 33, 34, 41, 39, 39, 48, 56], [40, 37, 33, 42, 38, 38, 41, 38, 38, 40, 44, 46, 50, 50], [40, 38, 39, 45, 42, 47, 43, 45, 46, 42, 43, 46, 49, 56], [48, 42, 48, 54, 44, 47, 51, 51, 52, 47, 47, 47, 54, 63]]

'''
from typing import *
class Solution:
    def minPathSum(self, grid: List[List[int]]) -> int:
        n=len(grid[0])
        m=len(grid)
        dp=[[0]*n for i in range(m)]

        for i in range(m):
            for j in range(n):

                left,top=0,0 # 记录左边和上边的值
                if i-1<0: #-1代表不在矩阵中
                    top=-1
                else:
                    top=dp[i-1][j]
                if j-1<0:
                    left=-1
                else:
                    left=dp[i][j-1]
                if left!=-1 and top!=-1:
                    dp[i][j]=min(left,top)+grid[i][j]
                else:# left和top超过了边界值，此时要么为grid[i][j]本身，只能向右或者向下
                    num=max(left,top)
                    if num==-1:
                        dp[i][j]=grid[i][j]
                    else:# left top任意一个为-1的情况
                        dp[i][j]=num+grid[i][j]
        print(dp)
        return dp[m-1][n-1]

    def minPathSum1(self, grid: List[List[int]]) -> int:
        # m 表示有多少行
        m = len(grid)

        # n 表示每一行有多少个元素，即 n 表示有多少列
        n = len(grid[0])

        # 设置二维数组 dp 用来储存每个位置的最优解
        # dp[0][0] 表示第 0 行第 0 列的最优解
        # dp[0][i] 表示第 0 行第 i 列的最优解
        # dp[j][0] 表示第 j 行第 0 列的最优解
        # dp[i][j] 表示第 i 行第 j 列的最优解
        dp = [[0] * n for _ in range(m)]

        # 初始化 dp[0][0]，由于只有一个元素
        # 所以 dp[0][0] 的最优解就是 grid[0][0] 这个元素
        dp[0][0] = grid[0][0]

        # i 从 1 遍历到 n - 1
        # 获取第 0 行中第 i 列的最优解
        # 比如 grid[0] 为 [1,3,2...]
        # 由于每次只能向下或者向右移动一步，此时只能向右移动一步
        # 那么 dp[0][i] 依次为 [1,4,6...]
        for i in range(1, n):
            # 所以对于只有一行的情况，当前位置的最优解等于前一列的最优解加上该列的值
            dp[0][i] = dp[0][i - 1] + grid[0][i]

        # i 从 1 遍历到 n - 1
        # 获取第 i 行中第 0 列的最优解
        # 比如 grid 为
        # [1,1,2.......]
        # [5,2,2.......]
        # [2,3,4.......]
        # [..,..,..,...]
        # 由于每次只能向下或者向右移动一步，此时只能向下移动一步
        # 那么 dp[i][0] 就是
        # [1,..........]
        # [6,..........]
        # [7,..........]
        # [............]
        for i in range(1, m):
            # 所以对于只有一列的情况，当前位置的最优解等于前一行的最优解加上该行的值
            dp[i][0] = dp[i - 1][0] + grid[i][0]

        # 接下来从第 1 行到第 m - 1 行
        # 从第 1 列到底 n - 1 列
        # 填充二维数组 dp 里面的值
        # dp[i][j] 表示第 i 行第 j 列的最优解
        for i in range(1, m):
            for j in range(1, n):
                # 由于每次只能向下或者向右移动一步
                # 位置 (i,j) 的最优解
                # 等于当前位置上方位置(i-1,j)的最优解和左侧位置(i,j-1)的最优解的较小值
                # 再加上当前位置的值
                dp[i][j] = min(dp[i - 1][j], dp[i][j - 1]) + grid[i][j]

                # dp[m-1][n-1] 表示第 m - 1 行第 n - 1 列的最优解
        # 返回这个结果即可
        print(dp)
        return dp[m - 1][n - 1]


if __name__=="__main__":
    grid = [[1,3,1],[1,5,1],[4,2,1]]
    solution=Solution()
    res=solution.minPathSum(grid)
    print(res)

    grid = [[1,2,3],[4,5,6]]
    solution=Solution()
    res=solution.minPathSum(grid)
    print(res)

    grid=[[0, 2, 2, 6, 4, 1, 6, 2, 9, 9, 5, 8, 4, 4], [0, 3, 6, 4, 5, 5, 9, 7, 8, 3, 9, 9, 5, 4],
     [6, 9, 0, 7, 2, 2, 5, 6, 3, 1, 0, 4, 2, 5], [3, 8, 2, 3, 2, 8, 8, 7, 5, 9, 6, 3, 4, 5],
     [4, 0, 1, 3, 9, 2, 0, 1, 6, 7, 9, 2, 8, 9], [6, 2, 7, 9, 0, 9, 5, 2, 7, 5, 1, 4, 4, 7],
     [9, 8, 3, 3, 0, 6, 8, 0, 8, 8, 3, 5, 7, 3], [7, 7, 4, 5, 9, 1, 5, 0, 2, 2, 2, 1, 7, 4],
     [5, 1, 3, 4, 1, 6, 0, 4, 3, 8, 4, 3, 9, 9], [0, 6, 4, 9, 4, 1, 5, 5, 4, 2, 5, 7, 4, 0],
     [0, 1, 6, 6, 4, 9, 2, 7, 8, 2, 1, 3, 3, 7], [8, 4, 9, 9, 2, 3, 8, 6, 6, 5, 4, 1, 7, 9]]

    solution=Solution()
    res=solution.minPathSum(grid)
    print(res)
